{
    "module": "keras",
    "class_name": "Sequential",
    "config": {
        "name": "sequential_647",
        "trainable": true,
        "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
                "name": "float32"
            },
            "registered_name": null
        },
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "input_shape": [
                        null,
                        8
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_layer_647"
                },
                "registered_name": null
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_1294",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "units": 88,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        8
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_545",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "rate": 0.4715520542732801,
                    "seed": null,
                    "noise_shape": null
                },
                "registered_name": null
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_1295",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "units": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        88
                    ]
                }
            }
        ],
        "build_input_shape": [
            null,
            8
        ]
    },
    "registered_name": null,
    "build_config": {
        "input_shape": [
            null,
            8
        ]
    },
    "compile_config": {
        "optimizer": {
            "module": "keras.optimizers",
            "class_name": "Adam",
            "config": {
                "name": "adam",
                "learning_rate": 0.01861441880464554,
                "weight_decay": null,
                "clipnorm": null,
                "global_clipnorm": null,
                "clipvalue": null,
                "use_ema": false,
                "ema_momentum": 0.99,
                "ema_overwrite_frequency": null,
                "loss_scale_factor": null,
                "gradient_accumulation_steps": null,
                "beta_1": 0.9,
                "beta_2": 0.999,
                "epsilon": 1e-07,
                "amsgrad": false
            },
            "registered_name": null
        },
        "loss": "mse",
        "loss_weights": null,
        "metrics": [
            "mean_squared_error"
        ],
        "weighted_metrics": null,
        "run_eagerly": false,
        "steps_per_execution": 1,
        "jit_compile": false
    }
}